zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F84xxx/MC56F84565/MC56F84565_COMMON.h
/*
** ###################################################################
**     Processor:           MC56F84565VLK
**     Compiler:            CodeWarrior C/C++ for DSP M56800E
**     Reference manual:    Manual version TBD
**     Version:             rev. 3.0, 2024-10-29
**     Build:               b250520
**
**     Abstract:
**         Peripheral Access Layer for MC56F84565
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2025 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 2.0 (2021-02-06)
**         Initial version.
**     - rev. 3.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file MC56F84565_COMMON.h
 * @version 3.0
 * @date 2024-10-29
 * @brief Peripheral Access Layer for MC56F84565
 *
 * Peripheral Access Layer for MC56F84565
 */

#if !defined(MC56F84565_COMMON_H_)
#define MC56F84565_COMMON_H_                     /**< Symbol preventing repeated inclusion */

/** Memory map major version (memory maps with equal major version number are
 * compatible) */
#define MCU_MEM_MAP_VERSION 0x0300U
/** Memory map minor version */
#define MCU_MEM_MAP_VERSION_MINOR 0x0000U


/* ----------------------------------------------------------------------------
   -- Interrupt IRQ numbers
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Interrupt_IRQ_numbers Interrupt IRQ numbers
 * @{
 */

/** Interrupt Number Definitions */
#define NUMBER_OF_INT_IRQ    101                 /**< Number of interrupts in the IRQ table */

typedef enum IRQn {
  /* Device specific interrupts */
  STPCNT_IRQn                  = 0,                /**< STPCNT interrupt */
  BKPT_IRQn                    = 1,                /**< BKPT interrupt */
  TRBUF_IRQn                   = 2,                /**< TRBUF interrupt */
  TX_REG_IRQn                  = 3,                /**< TX_REG interrupt */
  RX_REG_IRQn                  = 4,                /**< RX_REG interrupt */
  BUS_ERR_IRQn                 = 5,                /**< BUS_ERR interrupt */
  Reserved6_IRQn               = 6,                /**< Reserved interrupt */
  Reserved7_IRQn               = 7,                /**< Reserved interrupt */
  Reserved8_IRQn               = 8,                /**< Reserved interrupt */
  XBARA_IRQn                   = 9,                /**< XBARA interrupt */
  LVI1_IRQn                    = 10,               /**< LVI1 interrupt */
  OCCS_IRQn                    = 11,               /**< OCCS interrupt */
  TMRB_3_IRQn                  = 12,               /**< TMRB_3 interrupt */
  TMRB_2_IRQn                  = 13,               /**< TMRB_2 interrupt */
  TMRB_1_IRQn                  = 14,               /**< TMRB_1 interrupt */
  TMRB_0_IRQn                  = 15,               /**< TMRB_0 interrupt */
  TMRA_3_IRQn                  = 16,               /**< TMRA_3 interrupt */
  TMRA_2_IRQn                  = 17,               /**< TMRA_2 interrupt */
  TMRA_1_IRQn                  = 18,               /**< TMRA_1 interrupt */
  TMRA_0_IRQn                  = 19,               /**< TMRA_0 interrupt */
  ADC_CC1_IRQn                 = 20,               /**< ADC_CC1 interrupt */
  ADC_CC0_IRQn                 = 21,               /**< ADC_CC0 interrupt */
  ADC_ERR_IRQn                 = 22,               /**< ADC_ERR interrupt */
  COCO_IRQn                    = 23,               /**< COCO interrupt */
  DMA3_IRQn                    = 24,               /**< DMA3 interrupt */
  DMA2_IRQn                    = 25,               /**< DMA2 interrupt */
  DMA1_IRQn                    = 26,               /**< DMA1 interrupt */
  DMA0_IRQn                    = 27,               /**< DMA0 interrupt */
  CAN_MB_OR_IRQn               = 28,               /**< CAN_MB_OR interrupt */
  CAN_BUS_OFF_IRQn             = 29,               /**< CAN_BUS_OFF interrupt */
  CAN_ERROR_IRQn               = 30,               /**< CAN_ERROR interrupt */
  CAN_TX_WARN_IRQn             = 31,               /**< CAN_TX_WARN interrupt */
  CAN_RX_WARN_IRQn             = 32,               /**< CAN_RX_WARN interrupt */
  CAN_WAKEUP_IRQn              = 33,               /**< CAN_WAKEUP interrupt */
  QSCI2_RERR_IRQn              = 34,               /**< QSCI2_RERR interrupt */
  QSCI2_RCV_IRQn               = 35,               /**< QSCI2_RCV interrupt */
  QSCI2_TIDLE_IRQn             = 36,               /**< QSCI2_TIDLE interrupt */
  QSCI2_TDRE_IRQn              = 37,               /**< QSCI2_TDRE interrupt */
  QSCI1_RERR_IRQn              = 38,               /**< QSCI1_RERR interrupt */
  QSCI1_RCV_IRQn               = 39,               /**< QSCI1_RCV interrupt */
  QSCI1_TIDLE_IRQn             = 40,               /**< QSCI1_TIDLE interrupt */
  QSCI1_TDRE_IRQn              = 41,               /**< QSCI1_TDRE interrupt */
  QSCI0_RERR_IRQn              = 42,               /**< QSCI0_RERR interrupt */
  QSCI0_RCV_IRQn               = 43,               /**< QSCI0_RCV interrupt */
  QSCI0_TIDLE_IRQn             = 44,               /**< QSCI0_TIDLE interrupt */
  QSCI0_TDRE_IRQn              = 45,               /**< QSCI0_TDRE interrupt */
  Reserved46_IRQn              = 46,               /**< Reserved interrupt */
  Reserved47_IRQn              = 47,               /**< Reserved interrupt */
  QSPI1_XMIT_IRQn              = 48,               /**< QSPI1_XMIT interrupt */
  QSPI1_RCV_IRQn               = 49,               /**< QSPI1_RCV interrupt */
  QSPI0_XMIT_IRQn              = 50,               /**< QSPI0_XMIT interrupt */
  QSPI0_RCV_IRQn               = 51,               /**< QSPI0_RCV interrupt */
  I2C1_IRQn                    = 52,               /**< I2C1 interrupt */
  I2C0_IRQn                    = 53,               /**< I2C0 interrupt */
  eFlexPWMB_FAULT_IRQn         = 54,               /**< eFlexPWMB_FAULT interrupt */
  eFlexPWMB_RERR_IRQn          = 55,               /**< eFlexPWMB_RERR interrupt */
  eFlexPWMB_RELOAD3_IRQn       = 56,               /**< eFlexPWMB_RELOAD3 interrupt */
  eFlexPWMB_CAP3_IRQn          = 57,               /**< eFlexPWMB_CAP3 interrupt */
  eFlexPWMB_CMP3_IRQn          = 58,               /**< eFlexPWMB_CMP3 interrupt */
  eFlexPWMB_RELOAD2_IRQn       = 59,               /**< eFlexPWMB_RELOAD2 interrupt */
  eFlexPWMB_CAP2_IRQn          = 60,               /**< eFlexPWMB_CAP2 interrupt */
  eFlexPWMB_CMP2_IRQn          = 61,               /**< eFlexPWMB_CMP2 interrupt */
  eFlexPWMB_RELOAD1_IRQn       = 62,               /**< eFlexPWMB_RELOAD1 interrupt */
  eFlexPWMB_CAP1_IRQn          = 63,               /**< eFlexPWMB_CAP1 interrupt */
  eFlexPWMB_CMP1_IRQn          = 64,               /**< eFlexPWMB_CMP1 interrupt */
  eFlexPWMB_RELOAD0_IRQn       = 65,               /**< eFlexPWMB_RELOAD0 interrupt */
  eFlexPWMB_CAP0_IRQn          = 66,               /**< eFlexPWMB_CAP0 interrupt */
  eFlexPWMB_CMP0_IRQn          = 67,               /**< eFlexPWMB_CMP0 interrupt */
  eFlexPWMA_FAULT_IRQn         = 68,               /**< eFlexPWMA_FAULT interrupt */
  eFlexPWMA_RERR_IRQn          = 69,               /**< eFlexPWMA_RERR interrupt */
  eFlexPWMA_RELOAD3_IRQn       = 70,               /**< eFlexPWMA_RELOAD3 interrupt */
  eFlexPWMA_CAP_IRQn           = 71,               /**< eFlexPWMA_CAP interrupt */
  eFlexPWMA_CMP3_IRQn          = 72,               /**< eFlexPWMA_CMP3 interrupt */
  eFlexPWMA_RELOAD2_IRQn       = 73,               /**< eFlexPWMA_RELOAD2 interrupt */
  eFlexPWMA_CMP2_IRQn          = 74,               /**< eFlexPWMA_CMP2 interrupt */
  eFlexPWMA_RELOAD1_IRQn       = 75,               /**< eFlexPWMA_RELOAD1 interrupt */
  eFlexPWMA_CMP1_IRQn          = 76,               /**< eFlexPWMA_CMP1 interrupt */
  eFlexPWMA_RELOAD0_IRQn       = 77,               /**< eFlexPWMA_RELOAD0 interrupt */
  eFlexPWMA_CMP0_IRQn          = 78,               /**< eFlexPWMA_CMP0 interrupt */
  FTFL_RDCOL_IRQn              = 79,               /**< FTFL_RDCOL interrupt */
  FTFL_CC_IRQn                 = 80,               /**< FTFL_CC interrupt */
  CMPD_IRQn                    = 81,               /**< CMPD interrupt */
  CMPC_IRQn                    = 82,               /**< CMPC interrupt */
  CMPB_IRQn                    = 83,               /**< CMPB interrupt */
  CMPA_IRQn                    = 84,               /**< CMPA interrupt */
  PIT1_ROLLOVR_IRQn            = 85,               /**< PIT1_ROLLOVR interrupt */
  PIT0_ROLLOVR_IRQn            = 86,               /**< PIT0_ROLLOVR interrupt */
  PDB1_IRQn                    = 87,               /**< PDB1 interrupt */
  PDB0_IRQn                    = 88,               /**< PDB0 interrupt */
  QDC_INDEX_RO_RU_IRQn         = 89,               /**< QDC_INDEX_RO_RU interrupt */
  QDC_HOME_DOG_IRQn            = 90,               /**< QDC_HOME_DOG interrupt */
  QDC_COMPARE_IRQn             = 91,               /**< QDC_COMPARE interrupt */
  GPIOG_IRQn                   = 92,               /**< GPIOG interrupt */
  GPIOF_IRQn                   = 93,               /**< GPIOF interrupt */
  GPIOE_IRQn                   = 94,               /**< GPIOE interrupt */
  GPIOD_IRQn                   = 95,               /**< GPIOD interrupt */
  GPIOC_IRQn                   = 96,               /**< GPIOC interrupt */
  GPIOB_IRQn                   = 97,               /**< GPIOB interrupt */
  GPIOA_IRQn                   = 98,               /**< GPIOA interrupt */
  COP_INT_IRQn                 = 99,               /**< COP_INT interrupt */
  EWM_INT_IRQn                 = 100               /**< EWM_INT interrupt */
} IRQn_Type;

/*!
 * @}
 */ /* end of group Interrupt_IRQ_numbers */


/* ----------------------------------------------------------------------------
   -- Includes and Typedefs
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Includes_And_Typedes Includes and Typedefs
 * @{
 */

#include <stdint.h>

#define __IO volatile
#define __I const volatile
#define __O volatile

#ifdef __cplusplus
  typedef unsigned char uint8_t;
  typedef unsigned short uint16_t;
  typedef unsigned long uint32_t;
#endif

/*!
 * @}
 */ /* end of group Includes_And_Typedes */


